---
kind: type
id: T:Autodesk.Revit.DB.CylindricalFace
source: html/e0450bb3-d974-9759-ea41-55c332cd9926.htm
---
# Autodesk.Revit.DB.CylindricalFace

A cylindrical face of a 3d solid or open shell.

## Syntax (C#)
```csharp
public class CylindricalFace : Face
```

## Remarks
For details on the parameterization, refer to the documentation for CylindricalSurface .